# SQL Lite Beginer Tutorial

In [5]:
import pandas as pd
import numpy as np
import sqlite3 as db

In [37]:
connection = db.connect('database.db')
cur = connection.cursor()

In [42]:
cur.execute('select * from sqlite_schema')
print(cur.fetchall())

[('table', 'employees', 'employees', 2, 'CREATE TABLE "employees" (\n"index" INTEGER,\n  "empid" INTEGER,\n  "firstname" TEXT,\n  "lastname" TEXT\n)'), ('index', 'ix_employees_index', 'employees', 3, 'CREATE INDEX "ix_employees_index"ON "employees" ("index")')]

In [ ]:
cur.execute("DROP TABLE employees")

In [11]:
# Create a Table
cur.execute("CREATE TABLE IF NOT EXISTS employees (empid INTEGER PRIMARY KEY, firstname NVARCHAR(50), lastname NVARCHAR(50))")

In [15]:
# Truncate the table
cur.execute("DELETE FROM employees")

In [16]:
# Fetch all the table name
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cur.fetchall())

[('employees',)]

In [17]:
# Insert data to Table

cur.execute("INSERT INTO employees VALUES (1,'John','Doe')")
cur.execute("INSERT INTO employees VALUES (2,'Jason','Hale')")
cur.execute("INSERT INTO employees VALUES (3,'Sam','Billing')")

In [18]:
# Fetch all record
cur.execute("SELECT * FROM employees;")
print(cur.fetchall())

[(1, 'John', 'Doe'), (2, 'Jason', 'Hale'), (3, 'Sam', 'Billing')]

In [19]:
# Insert from List
new_records= [(4, 'Gustavo', 'Achong'),
 (5, 'Kim', 'Abercrombie'),
 (6, 'Pilar', 'Bernard'),
 (7, 'Frances', 'Adams'),
 (8, 'Margaret', 'Smith'),
 (9, 'Angela', 'Adams'),
 (10, 'Samuel', 'Agcaoili')]
cur.executemany('INSERT INTO employees VALUES (?, ?, ?)', new_records)

In [21]:
# Show all the record
cur.execute("SELECT * FROM employees;")
print(cur.fetchall())

[(1, 'John', 'Doe'), (2, 'Jason', 'Hale'), (3, 'Sam', 'Billing'), (4, 'Gustavo', 'Achong'), (5, 'Kim', 'Abercrombie'), (6, 'Pilar', 'Bernard'), (7, 'Frances', 'Adams'), (8, 'Margaret', 'Smith'), (9, 'Angela', 'Adams'), (10, 'Samuel', 'Agcaoili')]

In [23]:
connection.commit()

In [24]:
cur.close()
connection.close()

In [25]:
# connection to the database
connection = db.connect('database.db')
df_employees = pd.read_sql_query('select * from employees', connection)

In [26]:
# Show employee from data frame
df_employees.head()

   empid firstname     lastname
0      1      John          Doe
1      2     Jason         Hale
2      3       Sam      Billing
3      4   Gustavo       Achong
4      5       Kim  Abercrombie

In [31]:
df_new = df_employees[:-1]
df_new

   empid firstname     lastname
0      1      John          Doe
1      2     Jason         Hale
2      3       Sam      Billing
3      4   Gustavo       Achong
4      5       Kim  Abercrombie
5      6     Pilar      Bernard
6      7   Frances        Adams
7      8  Margaret        Smith
8      9    Angela        Adams

In [32]:
df_new.to_sql("employees", connection, if_exists="replace")

9

In [33]:
pd.read_sql_query('SELECT * FROM employees', connection)

   index  empid firstname     lastname
0      0      1      John          Doe
1      1      2     Jason         Hale
2      2      3       Sam      Billing
3      3      4   Gustavo       Achong
4      4      5       Kim  Abercrombie
5      5      6     Pilar      Bernard
6      6      7   Frances        Adams
7      7      8  Margaret        Smith
8      8      9    Angela        Adams

In [34]:
connection.close